{
  "metadata": {
    "description": "NL2Data Query Suite - Curated Regression Tests",
    "core_queries": [
      1,
      2,
      3,
      4,
      5,
      6,
      7,
      8,
      9,
      10,
      12,
      20
    ],
    "extended_queries": [
      11,
      13,
      14,
      15,
      16,
      17,
      18,
      19,
      21,
      22,
      23,
      24,
      25,
      26,
      27,
      28,
      29,
      30,
      31,
      32,
      33,
      34,
      35
    ],
    "total_queries": 35
  },
  "queries": [
    {
      "number": 1,
      "tier": "core",
      "text": "Generate a web clickstream dataset for a mid-sized e-commerce site with one session-level fact table and four dimension tables (user, device, referrer, page). The fact table should contain at least 30 million sessions over a 90-day period. Session lengths must follow a heavy-tailed distribution where most sessions are short but a small fraction have more than 100 events. Include a \"bot_detection_score\" feature where roughly 5–8% of sessions are high-confidence bots; these sessions should have abnormally high pageview counts and very short inter-event times. Model a sales funnel with the stages homepage → category → product → add_to_cart → checkout → purchase, and target an overall funnel conversion rate of about 2.5%. Traffic should show strong weekly seasonality (weekends at about 1.5× weekday volume) and diurnal patterns with peaks during local evening hours. The dataset should be suitable for testing window functions, sessionization logic, multi-step funnel queries, and skewed group-by workloads on user_id and product_id."
    },
    {
      "number": 2,
      "tier": "core",
      "text": "Create an IoT telemetry dataset for 10,000 industrial sensors deployed across 100 plants. There should be one high-frequency fact table called sensor_reading with at least 200 million rows over a 30-day period, plus dimension tables for sensors, plants, and sensor types. Sensor readings (temperature, vibration, current) should mostly remain within normal operating bands that differ by sensor type, with rare anomalies (0.1–0.5% of readings) modeled as spikes, drifts, or sudden step changes. Inject 3–5 \"cascading failure\" incidents in which a single plant experiences coordinated anomalies across many sensors in a narrow time window, and each incident is preceded by subtle early-warning deviations. Timestamps should be approximately uniform over time but with random missing intervals per sensor to simulate connectivity issues. Include synthetic maintenance events that reset some sensors' behavior. The data should stress time-series joins, anomaly detection queries, and \"before/after incident\" window aggregations."
    },
    {
      "number": 3,
      "tier": "core",
      "text": "Generate a financial transactions dataset with a large transaction fact table (at least 50 million rows) and dimension tables for customers, merchants, cards, and geography. Legitimate transactions should form the majority, with card-level spending showing strong weekly seasonality and pay-day spikes around the 1st and 15th of each month. Inject multiple fraud patterns: low-value test transactions followed by one or more high-value purchases; coordinated fraud rings where many cards transact with the same merchant in a short time window; and location anomalies where the same card has transactions in geographically distant locations within an impossible travel time. Label a small fraction of transactions as \"confirmed_fraud\", while leaving many suspicious patterns unlabeled. Transaction amounts should follow a log-normal distribution with a heavy tail, and merchant categories like electronics and travel should be over-represented among high-value transactions. The dataset should be useful for graph-based fraud detection queries, geo-temporal anomaly detection, and group-by workloads heavily skewed on merchant_id."
    },
    {
      "number": 4,
      "tier": "core",
      "text": "Create a synthetic healthcare dataset modeling longitudinal patient records. Include an encounter fact table (visits and admissions) with roughly 10 million rows, plus dimensions for patient, provider, facility, diagnosis, procedure, and medication. Patients should follow different care pathways for chronic conditions such as diabetes and hypertension, with diagnosis codes appearing before related medications and procedures in plausible temporal sequences. Age distribution should be skewed toward older patients, and comorbid conditions should cluster realistically (for example, diabetes and hypertension often co-occur). Introduce a policy change at a specific date that shifts treatment protocols, causing different medication and procedure patterns after that date. Include re-admission patterns where some patients are re-admitted within 30 days with related diagnoses. The dataset should be designed to stress complex cohort definitions, survival and time-to-event analyses, and joins across many dimensions with highly skewed diagnosis and procedure codes."
    },
    {
      "number": 5,
      "tier": "core",
      "text": "Generate a ride-sharing dataset with a trips fact table containing at least 40 million trips and dimension tables for rider, driver, geographic zone, and vehicle type. Trip durations and distances should follow realistic urban distributions, with different patterns for rush hours, nights, and off-peak times. Implement spatial–temporal surge pricing: certain zones at specific times should have a surge multiplier applied, especially around simulated events such as concerts, sports games, and public holidays. Model driver churn: new drivers join over time, some drivers become inactive after sequences of low earnings or long idle periods. Cancellation rates should be higher during adverse conditions such as heavy rain, very high surge, or long estimated arrival times. The dataset should stress spatiotemporal joins, group-by aggregations by zone and time-of-day, and highly skewed load in popular zones during surge events."
    },
    {
      "number": 6,
      "tier": "core",
      "text": "Create a dataset for a recommender-style retail system that combines transactional sales and interaction logs. Include a sales fact table, a product catalog dimension, a customer dimension, and an events log for product impressions and clicks. Product popularity should follow a strong Zipf distribution, where a small fraction of SKUs generate most of the revenue and traffic. Inject several marketing campaigns introducing new products: these cold-start items should receive heavy impression volume initially, with uncertain and noisy conversion rates. Customers should belong to segments with different preference profiles and click-through behaviors, such as bargain hunters, brand loyal customers, and novelty seekers. Include a recommended_product_id in the events log, where recommendations are sometimes noisy or mis-targeted, especially for certain segments. Event timestamps should allow reconstruction of top-N product rankings by day and by category. The dataset should stress joins between logs and dimensions, plus group-by aggregations on customer_id and product_id under heavy skew."
    },
    {
      "number": 7,
      "tier": "core",
      "text": "Generate a supply chain dataset with multiple interconnected processes. Create fact tables for purchase orders, shipments, inventory snapshots, and customer orders, and dimension tables for products, suppliers, warehouses, and regions. Model multi-stage lead times from supplier to port to central distribution center to regional warehouse to final customer, with variability driven by route, supplier reliability, and season. Inject disruption scenarios: for example, simulate a port closure for a week that causes backlogs and delayed arrivals, and simulate supplier quality issues that result in quarantined inventory and rework orders. Demand should be seasonal for some products and promotion-driven for others, leading to spikes in specific periods. Backorders and stockouts should occur in realistically bursty patterns for popular SKUs. The dataset should stress complex joins between multiple fact tables and cumulative inventory calculations over time."
    },
    {
      "number": 8,
      "tier": "core",
      "text": "Create an education platform dataset representing student learning trajectories. There should be an events fact table capturing student–content interactions (view, attempt, correct, incorrect, hint_requested), and dimensions for student, course, content item, and instructor. Students should exhibit different learning profiles: some improve quickly over time, others plateau, and a few regress. Each content item has a difficulty level, and the probability of a correct attempt depends on a latent student skill level, item difficulty, and some noise. Introduce intervention events: when a student has repeated failures on similar items, they receive hints or remedial content, which should measurably improve their future success probability. Time gaps between sessions should correlate with performance, with long idle periods associated with lower accuracy on subsequent attempts. The dataset should support cohort analysis, mastery estimation, and sequence-based queries over time-ordered student activity."
    },
    {
      "number": 9,
      "tier": "core",
      "text": "Generate a multi-tenant SaaS metrics dataset. Include a metric fact table with fields (tenant_id, metric_name, timestamp, value) and at least 100 million rows, plus dimension tables for tenant, region, and plan. Most tenants should have low traffic and low metric volume, while a few large tenants (\"whales\") generate very high traffic following a Zipf-like distribution across tenant_id. Shared infrastructure issues, such as a database cluster degradation in a particular region, should cause correlated latency spikes and error-rate increases across multiple tenants in that region but not globally. Add tenant-specific incidents, such as misconfigurations or bad deployments, that affect only one tenant's metrics. Metric types should include request_rate, error_rate, latency_p50, latency_p95, cpu_usage, and memory_usage. The dataset should stress multi-tenant group-by aggregations, time-window analytics, and detection of shared versus isolated incidents."
    },
    {
      "number": 10,
      "tier": "core",
      "text": "Create a CRM and marketing attribution dataset that models multi-touch customer journeys. Include a leads or contacts fact table, an interactions fact table capturing marketing touches (email open, email click, ad impression, ad click, website visit, sales call), and dimensions for channel, campaign, creative, and sales representative. Customer journeys should be multi-step sequences that may eventually lead to an opportunity being created and a deal being closed, with widely varying time lags between first touch and closing. Some deals should close after very few touches, while others require long nurture sequences across multiple channels. Different channels should have distinct conversion funnels and latency characteristics. Introduce realistic data quality issues such as multiple leads from the same company, duplicate contacts, and inconsistent campaign codes. The dataset should stress first-touch, last-touch, and multi-touch attribution queries, deduplication logic, and complex joins across events, leads, and opportunities."
    },
    {
      "number": 11,
      "tier": "extended",
      "text": "Generate a ride-sharing trip dataset for a large metropolitan area that explicitly models multiple derived columns. Include:\n* A trips fact table with at least 50 million rows and dimensions for rider, driver, zone, vehicle, and tariff_plan.\n* For each trip, generate base columns: `start_time`, `pickup_zone_id`, `dropoff_zone_id`, `duration_minutes`, `distance_km`, `base_fare_per_km`, `surge_multiplier`, `booking_fee`, and `driver_payout_ratio`.\n* Define the following derived columns (they must be computed, not sampled):\n* `end_time = start_time + duration_minutes (in minutes)`\n* `distance_miles = distance_km * 0.621371`\n* `gross_fare = distance_km * base_fare_per_km * surge_multiplier + booking_fee`\n* `tax_amount = gross_fare * tax_rate`, where `tax_rate` depends on pickup_zone_id (e.g., downtown 12%, suburbs 8%)\n* `discount_amount = gross_fare * promotional_discount_rate`, where promotional_discount_rate depends on tariff_plan and time of day\n* `net_fare = gross_fare - discount_amount + tax_amount`\n* `driver_earnings = net_fare * driver_payout_ratio`\n* `platform_fee = net_fare - driver_earnings`\n* Use realistic business rules in the distributions so that:\n* Longer trips tend to have higher surge_multiplier in peak hours.\n* Some tariff plans enforce a minimum `gross_fare`, which should be applied via a derived max/clip expression, not by sampling.\n* The dataset should be good for testing that all derived expressions (time arithmetic, chained numeric expressions, conditional clip/min/max logic) are applied correctly on large chunks."
    },
    {
      "number": 12,
      "tier": "core",
      "text": "Create a large-scale e-commerce order dataset that heavily relies on derived monetary and time fields. Include:\n* One orders fact table (≥ 30 million rows) and dimensions for customer, product, store, promotion, and tax_region.\n* Base columns per order line: `order_datetime`, `store_id`, `product_id`, `unit_price`, `quantity`, `discount_percent`, `tax_region_id`, `shipping_method`, `shipping_distance_km`, and `handling_fee`.\n* Define derived columns:\n* `line_subtotal = unit_price * quantity`\n* `discount_amount = line_subtotal * discount_percent`\n* `tax_rate = tax_region_base_rate + additional_rate_for_product_category` (the additional rate depends on the product category, not sampled directly; it should be encoded in the IR and applied as a derived expression that looks up a per-category rate column from the product dimension or a pre-joined view)\n* `tax_amount = (line_subtotal - discount_amount) * tax_rate`\n* `shipping_cost = base_shipping_fee + per_km_rate * shipping_distance_km`, with per_km_rate depending on shipping_method\n* `line_total = line_subtotal - discount_amount + tax_amount + shipping_cost + handling_fee`\n* `estimated_delivery_datetime = order_datetime + shipping_lead_time_days (converted into a timedelta)`\n* `delivery_sla_breached = 1 if actual_delivery_datetime > promised_delivery_datetime else 0` (use a derived boolean expression)\n* Include at least one scenario where tax rules change mid-year (policy change), so tax_rate must be derived from both tax_region_id and order_datetime.\n* This dataset should stress-test chained arithmetic, nested conditionals, date arithmetic, and boolean expressions in derived columns."
    },
    {
      "number": 13,
      "tier": "extended",
      "text": "Generate an energy consumption dataset for residential customers with multiple temporal derived features. Include:\n* A consumption fact table with hourly records for at least 100,000 households over one full year (≈ 876M rows), and dimensions for household, tariff_plan, and region.\n* Base columns per record: `timestamp`, `household_id`, `region_id`, `tariff_plan_id`, `consumption_kwh`, `outdoor_temp_c`, and `dynamic_price_per_kwh`.\n* Derived columns should include:\n* `billing_day = date part of timestamp`\n* `is_peak_hour = 1 if hour_of_day in peak set else 0`\n* `is_weekend = 1 if day_of_week is Saturday or Sunday else 0`\n* `baseline_price_per_kwh = function of tariff_plan_id` (taken from a dimension table, then propagated via a join and used in a derived expression)\n* `price_multiplier = dynamic_price_per_kwh / baseline_price_per_kwh`\n* `cost_before_rebate = consumption_kwh * dynamic_price_per_kwh`\n* `rebate_amount = where(consumption_kwh > threshold, cost_before_rebate * rebate_rate, 0)` where threshold and rebate_rate depend on tariff_plan_id\n* `final_cost = cost_before_rebate - rebate_amount`\n* `heating_degree_hours = where(outdoor_temp_c < 18, 18 - outdoor_temp_c, 0)`\n* `cooling_degree_hours = where(outdoor_temp_c > 24, outdoor_temp_c - 24, 0)`\n* Make sure the IR specifies these derived columns in terms of core columns, with conditional logic expressed via a where/if-else pattern, so you can verify that your derived engine handles numeric and boolean combinations at large scale."
    },
    {
      "number": 14,
      "tier": "extended",
      "text": "Create a financial transactions dataset for credit cards with emphasis on fraud-related derived features. Include:\n* A transaction fact table with at least 80 million rows and dimensions for card, merchant, MCC (merchant category code), country, and risk_profile.\n* Base columns per transaction: `transaction_id`, `card_id`, `merchant_id`, `mcc_id`, `transaction_datetime`, `amount_usd`, `exchange_rate`, `country_id`, `card_home_country_id`, `risk_profile_id`, and `is_chip_transaction`.\n* Define the following derived columns:\n* `amount_local_currency = amount_usd * exchange_rate`\n* `is_cross_border = 1 if country_id != card_home_country_id else 0`\n* `days_since_previous_txn = difference in days between transaction_datetime and previous transaction_datetime for the same card_id` (this can be approximated by precomputing per-card lag timestamps and exposing them as a column, then using a derived subtraction expression; the IR should treat the difference as derived, not sampled)\n* `avg_amount_last_7d = rolling average of amount_usd for the last 7 days for the same card_id` (similarly approximated via a pre-stage or via a simplified expression; the NL description should state that it is logically derived, even if your implementation uses a precomputed helper column)\n* `velocity_score = (number_of_transactions_last_24h / 10.0) + (total_amount_last_24h / 1000.0)`\n* `high_risk_mcc_flag = 1 if mcc_id is in a high-risk set else 0`\n* `fraud_risk_score = base_risk_score + 0.5 * is_cross_border + 0.7 * high_risk_mcc_flag + 0.3 * (amount_usd > high_amount_threshold)`\n* This dataset should focus on complex boolean and numeric derived expressions where multiple underlying signals are combined, which is ideal to stress-test your expression engine's handling of multiple operators and nested conditions."
    },
    {
      "number": 15,
      "tier": "extended",
      "text": "Generate a SaaS metrics dataset for a multi-tenant web application with heavy use of derived SLAs and aggregates. Include:\n* A metrics fact table with fields `(timestamp, tenant_id, cluster_id, metric_name, value)` and at least 150 million rows, plus dimensions for tenant, cluster, region, and plan_tier.\n* Restrict metric_name to a small set: `request_rate`, `error_rate`, `latency_p50`, `latency_p95`, `cpu_usage`, `memory_usage`.\n* For each (tenant_id, timestamp) combination, create derived \"virtual metrics\" as separate columns:\n* `error_rate_percent = error_rate * 100.0`\n* `latency_spread = latency_p95 - latency_p50`\n* `slo_latency_threshold_ms = function of plan_tier` (brought in via a dimension-based derived expression)\n* `slo_latency_breached = 1 if latency_p95 > slo_latency_threshold_ms else 0`\n* `cpu_headroom = 100.0 - cpu_usage`\n* `is_overloaded = 1 if (cpu_usage > 85 and memory_usage > 80) else 0`\n* Also define a per-tenant derived indicator:\n* `chronic_slo_violator = 1 if fraction_of_intervals_with_slo_latency_breached_over_last_7d > 0.05 else 0`\nwhere `fraction_of_intervals_with_slo_latency_breached_over_last_7d` is conceptually derived from the time series of the same tenant.\n* The IR should contain these derived expressions in terms of base metrics and dimension-driven thresholds, exercising arithmetic, comparison, boolean combination, and function-based derivation."
    },
    {
      "number": 16,
      "tier": "extended",
      "text": "Generate a ride-sharing trip dataset for a large city where the focus is on **supply–demand imbalance** and **dynamic pricing**. Capture short trips in the city center, long airport trips, and late-night surge windows. Include driver shifts, cancellations (by rider vs driver), and reassignments of trips to different drivers when the original driver cancels. Make sure the schema can support queries like: \"for each 15-minute interval and neighborhood, compute demand, available drivers, and average surge multiplier,\" and \"identify drivers who frequently cancel high-surge trips.\""
    },
    {
      "number": 17,
      "tier": "extended",
      "text": "Create a subscription-billing dataset for a SaaS product with **plan upgrades/downgrades**, **free trials**, and **prorated invoices**. Each customer can have multiple subscriptions over time (e.g., separate products or environments), and each subscription can change plans mid-cycle. Model invoices, line items, discounts, credits, taxes, and payment failures. The schema should make it easy to answer: \"MRR by plan on a given date,\" \"customers who churned within 30 days of an upgrade,\" and \"outstanding unpaid balances segmented by customer segment and region.\""
    },
    {
      "number": 18,
      "tier": "extended",
      "text": "Design an e-commerce **returns and refunds** dataset that explicitly models the lifecycle of a return: request created, item received at warehouse, inspection result, refund issued, and restock or discard decision.\nInclude:\n* Orders, order items, customers, and products (with categories and attributes like size/color).\n* Return requests with reasons (too small, defective, changed mind, etc.).\n* Inspection outcomes (approved, partial approved, rejected) and associated notes.\n* Refunds that may be **partial** (e.g., only one item from a multi-item order) or **split across payment methods** (gift card + card).\nThe schema should support queries like \"return rate by size per product over time\" and \"fraction of returns tagged as defective by supplier.\""
    },
    {
      "number": 19,
      "tier": "extended",
      "text": "Create a logistics and shipment dataset for a retailer that ships from **multiple warehouses** and supports **split shipments** for a single order.\nModel:\n* Orders and order items.\n* Shipments (each shipment can contain items from multiple orders; each order can produce multiple shipments).\n* Tracking events (picked, packed, handed to carrier, in-transit, out-for-delivery, delivered, failed-delivery, returned-to-sender).\n* Carrier-specific SLAs and promised delivery dates.\nData should allow queries like \"average delivery delay by carrier and region,\" \"orders where at least one shipment is lost,\" and \"items that frequently miss SLA when shipped from a specific warehouse.\""
    },
    {
      "number": 20,
      "tier": "core",
      "text": "Generate an HR / workforce dataset for a global company with **hierarchical org structure**, **job changes**, and **compensation history**.\nInclude:\n* Employees, departments, and a manager–subordinate hierarchy (supporting multiple reorgs over time).\n* Position history: promotions, lateral moves, and demotions with effective dates.\n* Compensation history: base salary, bonus target, stock grants, with region-specific currencies.\nThe schema should enable queries like \"org chart as of a given date,\" \"gender pay gap by level and region,\" and \"average time-to-promotion by department.\""
    },
    {
      "number": 21,
      "tier": "extended",
      "text": "Create a digital-marketing attribution dataset where users can interact across **multiple channels and devices** before conversion.\nRequirements:\n* User identities with a device graph (cookies, mobile device IDs, login IDs) that can be merged over time.\n* Touchpoints: impressions, clicks, email opens, push notifications, and direct visits, each with campaign, channel, and timestamp.\n* Conversions (e.g., purchases or sign-ups) with revenue and product/category tags.\nThe schema should make it possible to implement different attribution models (first-touch, last-touch, position-based, data-driven) and answer questions like \"top campaigns by incremental revenue last 30 days.\""
    },
    {
      "number": 22,
      "tier": "extended",
      "text": "Design an **event-driven monitoring** dataset for a cloud service that tracks **incidents, alerts, and deployments**.\nModel:\n* Services, clusters, and environments (prod, staging, etc.).\n* Time-series metrics summarized into intervals (CPU, memory, error rate, latency).\n* Incidents with start/end timestamps, severity, and impacted services.\n* Alerts fired from different detection rules (threshold-based, anomaly-based) and their relationship to incidents.\n* Deployments/releases with change metadata (commit hash, feature flags, owner team).\nThe schema should support queries like \"incidents within 30 minutes of a deployment,\" \"alerts that fired but did not correspond to any incident (false positives),\" and \"MTTR by service and severity.\""
    },
    {
      "number": 23,
      "tier": "extended",
      "text": "Create a **B2B contracts and usage** dataset for an API platform where customers sign contracts with **committed usage** and **overage pricing**.\nInclude:\n* Customers and contracts (start/end, committed monthly units, price tiers, SLAs).\n* API usage aggregated by day and endpoint, tagged by customer and environment.\n* Overage calculations (units above commitment) and invoices linked to both contract and usage.\n* SLA breaches computed from uptime/latency metrics per contract.\nEnsure the schema can express: \"monthly revenue vs committed revenue,\" \"customers consistently under-utilizing their commitment,\" and \"contracts frequently breaching SLA but not yet churned.\""
    },
    {
      "number": 24,
      "tier": "extended",
      "text": "Design a **food delivery platform** dataset that captures orders with **multi-party interactions** (customer, restaurant, courier).\nThe schema should cover:\n* Restaurants with opening hours, cuisines, and dynamic availability (open/closed/paused).\n* Menus and menu items with options/add-ons (extra cheese, size variants).\n* Orders and order items, with special instructions and scheduled vs ASAP orders.\n* Courier assignments, reassignments, and pickup/delivery timestamps.\n* Cancellations and refunds with reason codes (restaurant closed, courier unavailable, customer changed mind).\nIt should be possible to answer: \"median prep time per restaurant,\" \"couriers with unusually high cancellation rates,\" and \"orders delivered cold (delivery time way above restaurant's SLA).\""
    },
    {
      "number": 25,
      "tier": "extended",
      "text": "Create a **university academic records** dataset focused on **program changes, prerequisites, and retakes** rather than just simple enrollments.\nInclude:\n* Students with admission cohort, program/major history (with effective dates), and academic status (active, leave, dismissed, graduated).\n* Courses with prerequisite chains and equivalence mappings (legacy vs new course codes).\n* Enrollments with attempt number, grade, and flags for retake, withdrawal, or incomplete.\n* Term-level aggregates (GPA, credits attempted vs completed).\nThe schema should allow queries like \"students who changed major from STEM to non-STEM and then improved GPA,\" \"bottleneck courses with high failure rate among prerequisite chains,\" and \"average number of attempts before passing key gateway courses.\""
    },
    {
      "number": 26,
      "tier": "extended",
      "text": "Ride-hailing trips with event-driven surge. Model drivers, riders, zones, and trips with a status flow (REQUESTED → ACCEPTED → PICKED_UP → DROPPED_OFF or CANCELLED). Demand and cancellations spike during concerts and games in {stadium, downtown} zones, and on pay-days (day_of_month in {1,15}). Surge_multiplier should depend on the demand/supply ratio per 15‑minute bucket, weather conditions, and event proximity. Include pooling (shared trips), ETA estimates affected by traffic, and \"impossible driver jumps\" checks using geo distance and time differences. Workload should emphasize time-bucketed KPIs by zone and surge impact analysis."
    },
    {
      "number": 27,
      "tier": "extended",
      "text": "Card transactions and fraud signals\n* Tables for customers, cards, merchants, devices, transactions, disputes.\n* Amounts are heavy-tailed (lognormal), and merchant_id popularity is Zipfian; electronics and travel categories have heavier tails than groceries.\n* Velocity features: per-card counts and sums over last 10 minutes and 24 hours; lag to previous transaction timestamp and country.\n* Impossible travel: flag when geo_distance between consecutive transactions implies speed > 900 km/h within ts_diff.\n* Fraud rings: scenarios where many cards transact at the same merchant within a short window; device or IP reuse increases risk.\n* Constraints: card_id → customer_id; if is_fraud=1 then chargeback_within_30d=1."
    },
    {
      "number": 28,
      "tier": "extended",
      "text": "E‑commerce orders and returns with inventory realism. Model users, products, inventory, promotions, orders, order_lines, shipments, returns, and RMAs. Orders can mix coupons, gift cards, and tax jurisdictions; derived net_revenue must account for discounts, tax, shipping, and partial refunds after returns. Enforce state machines for both orders and shipments, and a non‑negative inventory invariant with restock on return. Shipping lead times vary by carrier and are longer on weekends/holidays; pay-day periods increase AOV. Workload should include cohort revenue by campaign and return rate by category."
    },
    {
      "number": 29,
      "tier": "extended",
      "text": "Industrial IoT in a manufacturing plant\n* Sensors emit readings every minute with sensor_id → (plant_id, line_id, sensor_type) as an FD.\n* Calibration drift is gradual; maintenance events reset drift.\n* Power outage incidents create missing data, spiky restarts, and correlated anomalies across sensors in the same line.\n* Rolling features: 15‑minute rolling_mean and rolling_std per sensor; anomaly flags depend on deviations from rolling baselines and recent maintenance.\n* Data gaps should be explicit (missing intervals) and influence derived flags; include a small set of bad sensors that intermittently freeze."
    },
    {
      "number": 30,
      "tier": "extended",
      "text": "Multi-tenant SaaS product metrics with SLOs. Model tenants, users, releases, incidents, and a metrics_timeseries (e.g., requests, error_rate, latency_p95) at 1‑minute or 5‑minute grain. Tenants follow a Zipf distribution for traffic. Incidents scoped to regions/services raise error_rate and latency; releases may regress or improve metrics. A \"chronic_slo_violator\" flag is true if latency_p95 breach rate exceeds 5% over the last 7 days per tenant. Workload focuses on time-series dashboards, incident postmortems, and tenant health leaderboards."
    },
    {
      "number": 31,
      "tier": "extended",
      "text": "Subscription billing with proration and add-ons\n* Entities: accounts, subscriptions, plans, plan_history (effective_from/to), invoices, invoice_line_items, payments, refunds, credits.\n* Mid-cycle upgrades/downgrades produce prorated charges; add-ons can be metered or flat.\n* Free trials, grace periods, and dunning retries affect status transitions (ACTIVE, PAST_DUE, CANCELED).\n* Currency ∈ {USD, EUR} with exchange rates by day; taxes differ by region.\n* Derived flags: churn_within_30d_of_upgrade; MRR/ARR calculations; recognition schedules for prepaid annual plans.\n* Constraints: if status='CANCELED' then end_date not null; (invoice_id, line_number) is a composite PK."
    },
    {
      "number": 32,
      "tier": "extended",
      "text": "Marketing journeys and attribution across channels. Represent users, identities (cookies, device_ids), touchpoints (channel ∈ {email, paid_search, social, organic, direct, retail}), sessions, and conversions. Identity stitching merges multiple cookies into a user graph with occasional resets; bots exist with high pageviews and near‑zero dwell time. Attribution supports last‑touch, first‑touch, and time-decay over 7 days; deduplicate same-channel touches in a 30‑minute window. Campaign calendars and promotions shift channel mix (e.g., during a sale weekend). Workload emphasizes multi-touch attribution tables and path analysis."
    },
    {
      "number": 33,
      "tier": "extended",
      "text": "Global supply chain shipments with disruptions\n* Entities: ports, facilities, routes, carriers, containers, shipments, legs, customs_events, weather_incidents.\n* Lead_time_days depends on route, season (month in {11,12,1} is slower), and container_type; customs holds add random delays.\n* Weather_incidents applied to region/time windows increase delays, cancellation probability, and damage risk; effects should cascade to multiple legs simultaneously.\n* Shipment status must follow a state machine (CREATED → DEPARTED → ARRIVED_PORT → CUSTOMS → IN_TRANSIT → DELIVERED, with optional CANCELLED/RETURNED).\n* Workload: \"delayed shipments last 14 days by port and carrier\", and \"ETA error distribution by route\"."
    },
    {
      "number": 34,
      "tier": "extended",
      "text": "Longitudinal healthcare encounters with readmissions. Model patients, encounters (inpatient/outpatient/ER), diagnoses, procedures, medications, labs, and providers. Enforce clinically plausible sequences such as diagnosis preceding related procedure; medication contraindications (e.g., pregnancy implies exclusion of certain drugs); patient_id → gender, DOB as FDs. Readmission_30d flag depends on encounter windows; labs correlate with diagnoses (e.g., elevated A1C with diabetes). Workload includes readmission rates by DRG and medication adherence over rolling 90‑day windows."
    },
    {
      "number": 35,
      "tier": "extended",
      "text": "Public library circulation (simple but thorough). Entities: members (tiers: child, adult, senior), items (isbn → title, author, subject), copies, loans, holds, fines, and events (holiday closures, reading campaigns). Loan status moves through REQUESTED → ON_HOLD → CHECKED_OUT → RETURNED or LOST; due dates adjust around closures. Overdue fines accrue daily; amnesty during campaigns. Workload includes rolling 30‑day checkouts by subject and hold-to-loan conversion rates; seasonality increases children's books circulation in summer months."
    }
  ]
}